const currencyWordsDict = {
  'AED': [['дирхам ОАЭ', 'дирхама ОАЭ', 'дирхам ОАЭ'], ['филс', 'филса', 'филсов']],
  'AFN': [['афгани', 'афгани', 'афгани'], ['пул', 'пула', 'пулов']],
  'ALL': [['лек', 'лека', 'леков'], ['киндарка', 'киндарки', 'киндарок']],
  'AMD': [['армянская драма', 'армянские драмы', 'армянских драм'], ['лума', 'лумы', 'лум']],
  'ANG': [['нидерландский гульден', 'нидерландских гульдена', 'нидерландских гульденов'], ['цент', 'цента', 'центов']],
  'AOA': [['кванза', 'кванзы', 'кванз'], ['сентимо', 'сентимо', 'сентимо']],
  'ARS': [['аргентинское песо', 'аргентинских песо', 'аргентинских песо'], ['сентаво', 'сентаво', 'сентаво']],
  'AUD': [['австралийский доллар', 'австралийских доллара', 'австралийских долларов'], ['цент', 'цента', 'центов']],
  'AWG': [['арубанский флорин', 'арубанских флорина', 'арубанских флоринов'], ['цент', 'цента', 'центов']],
  'AZN': [['манат', 'маната', 'манатов'], ['гяпик', 'гяпика', 'гяпиков']],
  'BAM': [['марка', 'марки', 'марок'], ['фенинг', 'фенинга', 'фенингов']],
  'BBD': [['барбадосский доллар', 'барбадосских доллара', 'барбадосских долларов'], ['цент', 'цента', 'центов']],
  'BDT': [['така', 'таки', 'так'], ['пойша', 'пойши', 'пойш']],
  'BGN': [['лев', 'лева', 'лев'], ['стотинка', 'стотинки', 'стотинок']],
  'BHD': [['динар', 'динара', 'динар'], ['сантим', 'сантима', 'сантимов']],
  'BIF': [['бурундийский франк', 'бурундийских франка', 'бурундийских франков'], ['сантим', 'сантима', 'сантимов']],
  'BMD': [['бермудский доллар', 'бермудских доллара', 'бермудских долларов'], ['цент', 'цента', 'центов']],
  'BND': [['брунейский доллар', 'брунейских доллара', 'брунейских долларов'], ['цент', 'цента', 'центов']],
  'BOB': [['боливиано', 'боливиано', 'боливиано'], ['сентаво', 'сентаво', 'сентаво']],
  'BRL': [['реал', 'реала', 'реалов'], ['сентаво', 'сентаво', 'сентаво']],
  'BSD': [['багамский доллар', 'багамских доллара', 'багамских долларов'], ['цент', 'цента', 'центов']],
  'BTN': [['нгултрум', 'нгултрум', 'нгултрум'], ['четрум', 'четрум', 'четрум']],
  'BWP': [['пула', 'пулы', 'пул'], ['тхебе', 'тхебе', 'тхебе']],
  'BYN': [['белорусский рубль', 'белорусских рубля', 'белорусских рублей'], ['копейка', 'копейки', 'копеек']],
  'BZD': [['белизский доллар', 'белизских доллара', 'белизских долларов'], ['цент', 'цента', 'центов']],
  'CAD': [['канадский доллар', 'канадских доллара', 'канадских долларов'], ['цент', 'цента', 'центов']],
  'CDF': [['конголезский франк', 'конголезских франка', 'конголезских франков'], ['сантим', 'сантима', 'сантимов']],
  'CHF': [['швейцарский франк', 'швейцарских франка', 'швейцарских франков'], ['раппен', 'раппена', 'раппенов']],
  'CLP': [['чилийское песо', 'чилийских песо', 'чилийских песо'], ['сентаво', 'сентаво', 'сентаво']],
  'CNY': [['юань', 'юаня', 'юаней'], ['фынь', 'фыня', 'фыней']],
  'COP': [['колумбийское песо', 'колумбийских песо', 'колумбийских песо'], ['сентаво', 'сентаво', 'сентаво']],
  'CRC': [['колон', 'колона', 'колонов'], ['сентимо', 'сентимо', 'сентимо']],
  'CUP': [['кубинское песо', 'кубинских песо', 'кубинских песо'], ['сентаво', 'сентаво', 'сентаво']],
  'CVE': [['эскудо Кабо-Верде', 'эскудо Кабо-Верде', 'эскудо Кабо-Верде'], ['сентаво', 'сентаво', 'сентаво']],
  'CZK': [['чешская крона', 'чешских кроны', 'чешских крон'], ['геллер', 'геллеры', 'геллеров']],
  'DJF': [['франк Джибути', 'франка Джибути', 'франков Джибути'], ['сантим', 'сантима', 'сантимов']],
  'DKK': [['датская крона', 'датские кроны', 'датских крон'], ['эре', 'эре', 'эре']],
  'DOP': [['доминиканское песо', 'доминиканских песо', 'доминиканских песо'], ['сентаво', 'сентаво', 'сентаво']],
  'DZD': [['алжирский динар', 'алжирских динара', 'алжирских динар'], ['сантим', 'сантима', 'сантимов']],
  'EGP': [['египетский фунт', 'египетских фунта', 'египетских фунтов'], ['пиастр', 'пиастра', 'пиастров']],
  'ERN': [['накфа', 'накфы', 'накф'], ['цент', 'цента', 'центов']],
  'ETB': [['быр', 'быра', 'быров'], ['цент', 'цента', 'центов']],
  'EUR': [['евро', 'евро', 'евро'], ['цент', 'цента', 'центов']],
  'FJD': [['доллар Фиджи', 'доллара Фиджи', 'долларов Фиджи'], ['цент', 'цента', 'центов']],
  'FKP': [['фунт Фолклендских островов', 'доллара Фолклендских островов', 'долларов Фолклендских островов'], ['пенс', 'пенса', 'пенсов']],
  'GBP': [['фунт стерлигов', 'фунта стерлингов', 'фунтов стерлингов'], ['пенс', 'пенса', 'пенсов']],
  'GEL': [['лари', 'лари', 'лари'], ['тетри', 'тетри', 'тетри']],
  'GHS': [['седи', 'седи', 'седи'], ['песева', 'песева', 'песев']],
  'GIP': [['гибралтарский фунт', 'гибралтарских фунта', 'гибралтарских фунтов'], ['пенни', 'пенни', 'пенни']],
  'GMD': [['даласи', 'даласи', 'даласи'], ['бутут', 'бутуты', 'бутутов']],
  'GNF': [['гвинейский франк', 'гвинейских франка', 'гвинейских франков'], ['сантим', 'сантима', 'сантимов']],
  'GTQ': [['кетсаль', 'кетсаля', 'кетсалей'], ['сентаво', 'сентаво', 'сентаво']],
  'GYD': [['гайанский доллар', 'гайанских доллара', 'гайанских долларов'], ['цент', 'цента', 'центов']],
  'HKD': [['гонконгский доллар', 'гонконгских доллара', 'гонконгских долларов'], ['цент', 'цента', 'центов']],
  'HNL': [['лемпира', 'лемпиры', 'лемпир'], ['сентаво', 'сентаво', 'сентаво']],
  'HRK': [['куна', 'куны', 'кун'], ['липа', 'липы', 'лип']],
  'HTG': [['гурд', 'гурда', 'гурдов'], ['сантим', 'сантима', 'сантимов']],
  'HUF': [['форинт', 'форинта', 'форинтов'], ['филлер', 'филлера', 'филлеров']],
  'IDR': [['рупия', 'рупии', 'рупией'], ['сен', 'сены', 'сен']],
  'ILS': [['шекель', 'шекеля', 'шекелей'], ['агора', 'агоры', 'агор']],
  'INR': [['индийская рупия', 'индийские рупии', 'индийских рупией'], ['пайса', 'пайсы', 'пайс']],
  'IQD': [['иракский динар', 'иракских динара', 'иракских динаров'], ['филс', 'филса', 'филсов']],
  'IRR': [['иранский риал', 'иранских риала', 'иранских риалов'], ['динар', 'динара', 'динаров']],
  'ISK': [['исландская крона', 'исландских кроны', 'исландских крон'], ['', '', '']],
  'JMD': [['ямайский доллар', 'ямайских доллара', 'ямайских долларов'], ['цент', 'цента', 'центов']],
  'JOD': [['иорданский динар', 'иорданских динара', 'иорданских динаров'], ['пиастр', 'пиастра', 'пиастров']],
  'JPY': [['иена', 'иены', 'иен'], ['сен', 'сены', 'сенов']],
  'KES': [['кенийский шиллинг', 'кенийских шиллинга', 'кенийских шиллингов'], ['цент', 'цента', 'центов']],
  'KGS': [['сом', 'сомы', 'сомов'], ['тыйын', 'тыйыны', 'тыйынов']],
  'KHR': [['риэль', 'риэля', 'риэлей'], ['сен', 'сены', 'сенов']],
  'KMF': [['франк Комор', 'франка Комор', 'франков Комор'], ['сантим', 'сантима', 'сантимов']],
  'KPW': [['северокорейская вона', 'сереверокорейские воны', 'северокорейских вон'], ['чон', 'чон', 'чон']],
  'KRW': [['вона', 'воны', 'вон'], ['чон', 'чон', 'чон']],
  'KWD': [['кувейтский динар', 'кувейтских динара', 'кувейтских динаров'], ['филс', 'филса', 'филсов']],
  'KYD': [['доллар островов Кайман', 'доллара островов Кайман', 'долларов островов Кайман'], ['цент', 'цента', 'центов']],
  'KZT': [['тенге', 'тенге', 'тенге'], ['тиын', 'тиына', 'тиынов']],
  'LAK': [['кип', 'кипа', 'кипов'], ['ат', 'аты', 'атов']],
  'LBP': [['ливанский фунт', 'ливанских фунта', 'ливанских фунтов'], ['пиастр', 'пиастра', 'пиастров']],
  'LKR': [['шри-ланкийская рупия', 'шри-ланкийские рупии', 'шри-ланкийских рупий'], ['цент', 'цента', 'центов']],
  'LRD': [['либерийский доллар', 'либерийских доллара', 'либерийских долларов'], ['цент', 'цента', 'центов']],
  'LSL': [['лоти', 'малоти', 'малоти'], ['сенте', 'лисенте', 'лисенте']],
  'LTL': [['лит', 'лита', 'литов'], ['цент', 'цента', 'центов']],
  'LYD': [['ливийский динар', 'ливийских динара', 'ливийских динаров'], ['дирхам', 'дирхама', 'дирхамов']],
  'MAD': [['марокканский дирхам', 'марокканских дирхама', 'марокканских дирхамов'], ['сантим', 'сантима', 'сантимов']],
  'MDL': [['молдавский лей', 'молдавских лея', 'молдавских леев'], ['бань', 'баня', 'баней']],
  'MGA': [['малагасийский ариари', 'малагасийских ариари', 'малагасийских ариари'], ['ираймбиланья', 'ираймбиланьи', 'ираймбиланий']],
  'MKD': [['денар', 'денара', 'денаров'], ['дени', 'дени', 'дени']],
  'MMK': [['кьят', 'кьята', 'кьят'], ['пья', 'пья', 'пья']],
  'MNT': [['тугрик', 'тугрика', 'тугриков'], ['мунгу', 'мунгу', 'мунгу']],
  'MOP': [['патка', 'патаки', 'патак'], ['аво', 'аво', 'аво']],
  'MRU': [['угия', 'угии', 'угий'], ['хумс', 'хумса', 'хумсей']],
  'MUR': [['маврикийская рупия', 'маврикийские рупии', 'маврикийский рупий'], ['цент', 'цента', 'центов']],
  'MVR': [['руфия', 'руфии', 'руфий'], ['лари', 'лари', 'лари']],
  'MWK': [['квача', 'квачи', 'квач'], ['тамбала', 'твмбалы', 'тамбал']],
  'MXN': [['мексиканское песо', 'мексиканских песо', 'мексиканских песо'], ['сентаво', 'сентаво', 'сентаво']],
  'MYR': [['малазийский ринггит', 'малазийских ринггита', 'малазийских ринггитов'], ['сен', 'сена', 'сенов']],
  'MZN': [['мозамбикский метикал', 'мозамбикских метикала', 'мозамбикских метикалов'], ['сентаво', 'сентаво', 'сентаво']],
  'NAD': [['доллар Намибии', 'доллара Намибии', 'долларов Намибии'], ['цент', 'цента', 'центов']],
  'NGN': [['найра', 'найры', 'найр'], ['кобо', 'кобо', 'кобо']],
  'NIO': [['золотая кордоба', 'золотые кордобы', 'золотых кордоб'], ['сентаво', 'сентаво', 'сентаво']],
  'NOK': [['норвежская крона', 'норвежские кроны', 'норвежских крон'], ['эре', 'эре', 'эре']],
  'NPR': [['непальская рупия', 'непальские рупии', 'непальских рупей'], ['пайс', 'пайса', 'пайсов']],
  'NZD': [['Новозеландский доллар', 'Новозеландских доллара', 'Новозеландских долларов'], ['цент', 'цента', 'центов']],
  'OMR': [['оманский риал', 'оманских риала', 'оманских риалов'], ['байза', 'байзы', 'байз']],
  'PAB': [['бальбоа', 'бальбоа', 'бальбоа'], ['сентесимо', 'сентесимо', 'сентесимо']],
  'PEN': [['соль', 'соли', 'солей'], ['сентимо', 'сентимо', 'сентимо']],
  'PGK': [['кина', 'кина', 'кина'], ['тойя', 'тойя', 'тойя']],
  'PHP': [['филиппинское песо', 'филиппинских песо', 'филиппинских песо'], ['сентимо', 'сентимо', 'сентимо']],
  'PKR': [['пакистанская рупия', 'пакистанские рупии', 'пакистанских рупий'], ['пайса', 'пайсы', 'пайс']],
  'PLN': [['злотый', 'злотых', 'злотых'], ['грош', 'гроша', 'грошей']],
  'PYG': [['гуарани', 'гуарани', 'гуарани'], ['сентимо', 'сентимо', 'сентимо']],
  'QAR': [['катарский риал', 'катарских риала', 'катарских риалов'], ['дирхам', 'дирхама', 'дирхамов']],
  'RON': [['румынский лей', 'румынский лея', 'румынских леев'], ['бань', 'баня', 'баней']],
  'RSD': [['сербский динар', 'сербских динара', 'сербских динаров'], ['пара', 'пары', 'пар']],
  'RUB': [['рубль', 'рубля', 'рублей'], ['копейка', 'копейки', 'копеек']],
  'RWF': [['франк Руанды', 'франка Руанды', 'франков Руанды'], ['сантим', 'сантима', 'сантимов']],
  'SAR': [['саудовский риял', 'саудовских рияла', 'саудовских риялов'], ['халал', 'халала', 'халалов']],
  'SBD': [['доллар Соломоновых островов', 'доллара Соломоновых островов', 'долларов Соломоновых островов'], ['цент', 'цента', 'центов']],
  'SCR': [['сейшельская рупия', 'сейшельские рупии', 'сейшельских рупий'], ['цент', 'цента', 'центов']],
  'SDG': [['суданский фунт', 'суданских фунта', 'суданских фунтов'], ['пиастр', 'пиастра', 'пиастров']],
  'SEK': [['шведская крона', 'шведские кроны', 'шведских крон'], ['эре', 'эре', 'эре']],
  'SGD': [['сингапурский доллар', 'сингапурских доллара', 'сингапурских долларов'], ['цент', 'цента', 'центов']],
  'SHP': [['фунт Святой Елены', 'фунта Святой Елены', 'фунтов Святой Елены'], ['пенни', 'пенни', 'пенни']],
  'SLL': [['леоне', 'леоне', 'леоне'], ['цент', 'цента', 'центов']],
  'SOS': [['сомалийский шиллинг', 'сомалийский шиллинга', 'сомалийский шиллингов'], ['цент', 'цента', 'центов']],
  'SRD': [['суринамский доллар', 'суринамских доллара', 'суринамских долларов'], ['цент', 'цента', 'центов']],
  'SSP': [['южносуданский фунт', 'южносуданских фунта', 'южносуданских фунтов'], ['пиастр', 'пиастра', 'пиастров']],
  'STN': [['добра', 'добры', 'добр'], ['сентимо', 'сентимо', 'сентимо']],
  'SVC': [['сальвадорский колон', 'сальвадорских колона', 'сальвадорских колонов'], ['сентаво', 'сентаво', 'сентаво']],
  'SYP': [['сирийский фунт', 'сирийских фунта', 'сирийских фунтов'], ['пиастр', 'пиастра', 'пиастров']],
  'SZL': [['лилангени', 'эмалангени', 'эмалангени'], ['цент', 'цента', 'центов']],
  'THB': [['бат', 'бата', 'батов'], ['сатанг', 'сатанга', 'сатангов']],
  'TJS': [['сомони', 'сомони', 'сомони'], ['дирам', 'дирама', 'дирамов']],
  'TMT': [['туркменский манат', 'туркменских маната', 'туркменских манатов'], ['тенге', 'тенге', 'тенге']],
  'TND': [['тунисский динар', 'тунисских динара', 'тунисских динар'], ['миллим', 'миллима', 'миллимов']],
  'TOP': [['паанга', 'паанги', 'паанг'], ['сенити', 'сенити', 'сенити']],
  'TRY': [['турецкая лира', 'турецкие лиры', 'турецких лир'], ['куруш', 'куруши', 'курушей']],
  'TTD': [['доллар Тринидада и Тобаго', 'доллара Тринидада и Тобаго', 'долларов Тринидада и Тобаго'], ['цент', 'цента', 'центов']],
  'TWD': [['тайваньский доллар', 'тайваньских доллара', 'тайваньских долларов'], ['фынь', 'фыня', 'фыней']],
  'TZS': [['танзанийский шиллинг', 'танзанийских шиллинга', 'танзанийских шиллингов'], ['цент', 'цента', 'центов']],
  'UAH': [['гривна', 'гривны', 'гривен'], ['копейка', 'копейки', 'копеек']],
  'UGX': [['угандийский шиллинг', 'угандийских шиллинга', 'угандийских шиллингов'], ['цент', 'цента', 'центов']],
  'USD': [['доллар США', 'доллара США', 'долларов США'], ['цент', 'цента', 'центов']],
  'UYU': [['уругвайское песо', 'уругвайских песо', 'уругвайских песо'], ['сентесимо', 'сентесимо', 'сентесимо']],
  'UZS': [['cум', 'cумы', 'cумов'], ['тийин', 'тийины', 'тийинов']],
  'VEF': [['боливар фуэрте', 'боливара фуэрте', 'боливаров фуэрте'], ['сентимо', 'сентимо', 'сентимо']],
  'VND': [['донг', 'донга', 'донгов'], ['су', 'су', 'су']],
  'VUV': [['вату', 'вату', 'вату'], ['', '', '']],
  'WST': [['тала', 'талы', 'тал'], ['сене', 'сене', 'сене']],
  'XAF': [['франк КФА ВЕАС', 'франка КФА ВЕАС', 'франков КФА ВЕАС'], ['сантим', 'сантима', 'сантимов']],
  'XCD': [['восточно-карибский доллар', 'восточно-карибских доллара', 'восточно-карибских долларов'], ['цент', 'цента', 'центов']],
  'XOF': [['франк КФА ВСЕАО', 'франка КФА ВСЕАО', 'франков КФА ВСЕАО'], ['сантим', 'сантима', 'сантимов']],
  'XPF': [['франк КФП', 'франка КФП', 'франков КФП'], ['сантим', 'сантима', 'сантимов']],
  'YER': [['йеменский риал', 'йеменских риала', 'йеменских риалов'], ['филс', 'филса', 'филсов']],
  'ZAR': [['рэнд', 'рэнда', 'рэндов'], ['цент', 'цента', 'центов']],
  'ZMW': [['замбийская квача', 'замбийских квачи', 'замбийских квач'], ['нгве', 'нгве', 'нгве']],
  'ZWL': [['доллар Зимбабве', 'доллара Зимбабве', 'долларов Зимбабве'], ['цент', 'цента', 'центов']]
};

const words = [
  [
    '', 'один', 'два', 'три', 'четыре', 'пять', 'шесть',
    'семь', 'восемь', 'девять', 'десять', 'одиннадцать',
    'двенадцать', 'тринадцать', 'четырнадцать', 'пятнадцать',
    'шестнадцать', 'семнадцать', 'восемнадцать', 'девятнадцать'
  ],
  [
    '', '', 'двадцать', 'тридцать', 'сорок', 'пятьдесят',
    'шестьдесят', 'семьдесят', 'восемьдесят', 'девяносто'
  ],
  [
    '', 'сто', 'двести', 'триста', 'четыреста', 'пятьсот',
    'шестьсот', 'семьсот', 'восемьсот', 'девятьсот'
  ]
];

const toFloat = (number) => {
  return parseFloat(number);
};

const plural = (count, options) => {
  if (options.length !== 3) {
    return false;
  }

  count = Math.abs(count) % 100;
  const rest = count % 10;

  if (count > 10 && count < 20) {
    return options[2];
  }

  if (rest > 1 && rest < 5) {
    return options[1];
  }

  if (rest === 1) {
    return options[0];
  }

  return options[2];
};

const parseNumber = (number, count, currCode) => {
  let first;
  let second;
  let numeral = '';
  const currencyWords = currencyWordsDict[currCode][0];

  if (number.length === 3) {
    first = number.substr(0, 1);
    number = number.substr(1, 3);
    numeral = '' + words[2][first] + ' ';
  }

  if (number < 20) {
    numeral = numeral + words[0][toFloat(number)] + ' ';
  } else {
    first = number.substr(0, 1);
    second = number.substr(1, 2);
    numeral = numeral + words[1][first] + ' ' + words[0][second] + ' ';
  }

  if (count === 0) {
    numeral = numeral + plural(number, currencyWords);
  } else if (count === 1) {
    if (numeral !== '  ') {
      numeral = numeral + plural(number, ['тысяча ', 'тысячи ', 'тысяч ']);
      numeral = numeral.replace('один ', 'одна ').replace('два ', 'две ');
    }
  } else if (count === 2) {
    if (numeral !== '  ') {
      numeral = numeral + plural(number, ['миллион ', 'миллиона ', 'миллионов ']);
    }
  } else if (count === 3) {
    numeral = numeral + plural(number, ['миллиард ', 'миллиарда ', 'миллиардов ']);
  }

  return numeral;
};

const parseDecimals = (number, currCode) => {
  const bargainingChipWords = currencyWordsDict[currCode][1];
  const text = plural(number, bargainingChipWords);

  if (number === 0) {
    number = '00';
  } else if (number < 10) {
    number = '0' + number;
  }

  return ' ' + number + ' ' + text;
};

export const parseMoney = (number, currCode) => {
  if (!number) {
    return false;
  }

  const type = typeof number;
  if (type !== 'number' && type !== 'string') {
    return false;
  }

  if (type === 'string') {
    number = toFloat(number.replace(',', '.'));

    if (isNaN(number)) {
      return false;
    }
  }

  if (number <= 0) {
    return false;
  }

  let splt;
  let decimals;

  number = number.toFixed(2);
  if (number.indexOf('.') !== -1) {
    splt = number.split('.');
    number = splt[0];
    decimals = splt[1];
  }

  let numeral = '';
  let length = number.length - 1;
  let parts = '';
  let count = 0;
  let digit;

  while (length >= 0) {
    digit = number.substr(length, 1);
    parts = digit + parts;

    if ((parts.length === 3 || length === 0) && !isNaN(toFloat(parts))) {
      numeral = parseNumber(parts, count, currCode) + numeral;
      parts = '';
      count++;
    }

    length--;
  }

  numeral = numeral.replace(/\s+/g, ' ');

  if (decimals) {
    numeral = numeral + parseDecimals(toFloat(decimals), currCode);
  }

  return numeral;
};
